Hoopz/test cases/hoopz_cloudapp_net.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.4" jmeter="2.9 r1437961">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="adserverLogin" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">2000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">500</stringProp>
        <longProp name="ThreadGroup.start_time">1418117082000</longProp>
        <longProp name="ThreadGroup.end_time">1418117082000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">hoopz.cloudapp.net</stringProp>
          <stringProp name="HTTPSampler.concurrentPool">4</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
          <collectionProp name="CookieManager.cookies"/>
          <boolProp name="CookieManager.clearEachIteration">false</boolProp>
          <stringProp name="CookieManager.policy">ignorecookies</stringProp>
          <stringProp name="CookieManager.implementation">org.apache.jmeter.protocol.http.control.HC4CookieHandler</stringProp>
        </CookieManager>
        <hashTree/>
        <CacheManager guiclass="CacheManagerGui" testclass="CacheManager" testname="HTTP Cache Manager" enabled="true">
          <boolProp name="clearEachIteration">false</boolProp>
          <boolProp name="useExpires">false</boolProp>
        </CacheManager>
        <hashTree/>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="parameter1" elementType="Argument">
              <stringProp name="Argument.name">parameter1</stringProp>
              <stringProp name="Argument.value">led</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="parameter2" elementType="Argument">
              <stringProp name="Argument.name">parameter2</stringProp>
              <stringProp name="Argument.value">bag</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="parameter3" elementType="Argument">
              <stringProp name="Argument.name">parameter3</stringProp>
              <stringProp name="Argument.value">goggle</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Throughput Controller" enabled="true">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <intProp name="ThroughputController.maxThroughput">50</intProp>
          <FloatProperty>
            <name>ThroughputController.percentThroughput</name>
            <value>33.0</value>
            <savedValue>0.0</savedValue>
          </FloatProperty>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Req1 ${parameter1}" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">&lt;request&gt;&lt;keywords&gt;${parameter1}&lt;/keywords&gt;&lt;url&gt;http://mysakal.com&lt;/url&gt;&lt;timeZoneOffset&gt;+0530&lt;/timeZoneOffset&gt;&lt;modelName&gt;Emulator 2.3.4&lt;/modelName&gt;&lt;modelId&gt;31120012013597301008201220060752&lt;/modelId&gt;&lt;os&gt;Windows&lt;/os&gt;&lt;deviceType&gt;phone&lt;/deviceType&gt;&lt;screenWidth&gt;1349&lt;/screenWidth&gt;&lt;screenHeight&gt;842&lt;/screenHeight&gt;&lt;oemOperatorKey&gt;3400105b-1fa8-484c-93a3-aa52a701c30b&lt;/oemOperatorKey&gt;&lt;carrier&gt;&lt;/carrier&gt;&lt;adType&gt;100&lt;/adType&gt;&lt;imeiNumber&gt;12121212121&lt;/imeiNumber&gt;&lt;mobileNo&gt;&lt;/mobileNo&gt;&lt;simImsiNumber&gt;&lt;/simImsiNumber&gt;&lt;publisherKey&gt;f4704f50-eed6-45dd-8927-eaf170905520&lt;/publisherKey&gt;&lt;oemOperatorName&gt;demo.oem&lt;/oemOperatorName&gt;&lt;language&gt;en_us&lt;/language&gt;&lt;fullImage&gt;1&lt;/fullImage&gt;&lt;geoLocation&gt;Pune:Maharashtra:India&lt;/geoLocation&gt;&lt;clientId&gt;110&lt;/clientId&gt;&lt;noOfAdRequired&gt;10&lt;/noOfAdRequired&gt;&lt;mediaProperty&gt;Sakal&lt;/mediaProperty&gt;&lt;mediaPropertyType&gt;Mobile&lt;/mediaPropertyType&gt;&lt;mediaCategory&gt;Education&lt;/mediaCategory&gt;&lt;slot&gt;p4s1&lt;/slot&gt;&lt;page&gt;p3&lt;/page&gt;&lt;/request&gt;</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/ws/AdvertiserService/fetchAd</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            <boolProp name="HTTPSampler.monitor">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/xml</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
        </hashTree>
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Throughput Controller" enabled="true">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <intProp name="ThroughputController.maxThroughput">50</intProp>
          <FloatProperty>
            <name>ThroughputController.percentThroughput</name>
            <value>33.0</value>
            <savedValue>0.0</savedValue>
          </FloatProperty>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Req2 ${parameter2}" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">&lt;request&gt;&lt;keywords&gt;${parameter2}&lt;/keywords&gt;&lt;url&gt;http://mysakal.com&lt;/url&gt;&lt;timeZoneOffset&gt;+0530&lt;/timeZoneOffset&gt;&lt;modelName&gt;Emulator 2.3.4&lt;/modelName&gt;&lt;modelId&gt;31120012013597301008201220060752&lt;/modelId&gt;&lt;os&gt;Windows&lt;/os&gt;&lt;deviceType&gt;phone&lt;/deviceType&gt;&lt;screenWidth&gt;1349&lt;/screenWidth&gt;&lt;screenHeight&gt;842&lt;/screenHeight&gt;&lt;oemOperatorKey&gt;3400105b-1fa8-484c-93a3-aa52a701c30b&lt;/oemOperatorKey&gt;&lt;carrier&gt;&lt;/carrier&gt;&lt;adType&gt;100&lt;/adType&gt;&lt;imeiNumber&gt;12121212121&lt;/imeiNumber&gt;&lt;mobileNo&gt;&lt;/mobileNo&gt;&lt;simImsiNumber&gt;&lt;/simImsiNumber&gt;&lt;publisherKey&gt;f4704f50-eed6-45dd-8927-eaf170905520&lt;/publisherKey&gt;&lt;oemOperatorName&gt;demo.oem&lt;/oemOperatorName&gt;&lt;language&gt;en_us&lt;/language&gt;&lt;fullImage&gt;1&lt;/fullImage&gt;&lt;geoLocation&gt;Pune:Maharashtra:India&lt;/geoLocation&gt;&lt;clientId&gt;110&lt;/clientId&gt;&lt;noOfAdRequired&gt;10&lt;/noOfAdRequired&gt;&lt;mediaProperty&gt;Sakal&lt;/mediaProperty&gt;&lt;mediaPropertyType&gt;Mobile&lt;/mediaPropertyType&gt;&lt;mediaCategory&gt;Education&lt;/mediaCategory&gt;&lt;slot&gt;p4s1&lt;/slot&gt;&lt;page&gt;p3&lt;/page&gt;&lt;/request&gt;</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/ws/AdvertiserService/fetchAd</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            <boolProp name="HTTPSampler.monitor">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/xml</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
        </hashTree>
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Throughput Controller" enabled="true">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <intProp name="ThroughputController.maxThroughput">50</intProp>
          <FloatProperty>
            <name>ThroughputController.percentThroughput</name>
            <value>33.0</value>
            <savedValue>0.0</savedValue>
          </FloatProperty>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Req3 ${parameter3}" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">&lt;request&gt;&lt;keywords&gt;${parameter3}&lt;/keywords&gt;&lt;url&gt;http://mysakal.com&lt;/url&gt;&lt;timeZoneOffset&gt;+0530&lt;/timeZoneOffset&gt;&lt;modelName&gt;Emulator 2.3.4&lt;/modelName&gt;&lt;modelId&gt;31120012013597301008201220060752&lt;/modelId&gt;&lt;os&gt;Windows&lt;/os&gt;&lt;deviceType&gt;phone&lt;/deviceType&gt;&lt;screenWidth&gt;1349&lt;/screenWidth&gt;&lt;screenHeight&gt;842&lt;/screenHeight&gt;&lt;oemOperatorKey&gt;3400105b-1fa8-484c-93a3-aa52a701c30b&lt;/oemOperatorKey&gt;&lt;carrier&gt;&lt;/carrier&gt;&lt;adType&gt;100&lt;/adType&gt;&lt;imeiNumber&gt;12121212121&lt;/imeiNumber&gt;&lt;mobileNo&gt;&lt;/mobileNo&gt;&lt;simImsiNumber&gt;&lt;/simImsiNumber&gt;&lt;publisherKey&gt;f4704f50-eed6-45dd-8927-eaf170905520&lt;/publisherKey&gt;&lt;oemOperatorName&gt;demo.oem&lt;/oemOperatorName&gt;&lt;language&gt;en_us&lt;/language&gt;&lt;fullImage&gt;1&lt;/fullImage&gt;&lt;geoLocation&gt;Pune:Maharashtra:India&lt;/geoLocation&gt;&lt;clientId&gt;110&lt;/clientId&gt;&lt;noOfAdRequired&gt;10&lt;/noOfAdRequired&gt;&lt;mediaProperty&gt;Sakal&lt;/mediaProperty&gt;&lt;mediaPropertyType&gt;Mobile&lt;/mediaPropertyType&gt;&lt;mediaCategory&gt;Education&lt;/mediaCategory&gt;&lt;slot&gt;p4s1&lt;/slot&gt;&lt;page&gt;p3&lt;/page&gt;&lt;/request&gt;</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/ws/AdvertiserService/fetchAd</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            <boolProp name="HTTPSampler.monitor">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/xml</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="SakalFetchAdKeywordRequest" enabled="false">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">&lt;request&gt;&lt;keywords&gt;mudyogni&lt;/keywords&gt;&lt;url&gt;http://mysakal.com&lt;/url&gt;&lt;timeZoneOffset&gt;+0530&lt;/timeZoneOffset&gt;&lt;modelName&gt;Emulator 2.3.4&lt;/modelName&gt;&lt;modelId&gt;31120012013597301008201220060752&lt;/modelId&gt;&lt;os&gt;Windows&lt;/os&gt;&lt;deviceType&gt;phone&lt;/deviceType&gt;&lt;screenWidth&gt;1349&lt;/screenWidth&gt;&lt;screenHeight&gt;842&lt;/screenHeight&gt;&lt;oemOperatorKey&gt;3400105b-1fa8-484c-93a3-aa52a701c30b&lt;/oemOperatorKey&gt;&lt;carrier&gt;&lt;/carrier&gt;&lt;adType&gt;100&lt;/adType&gt;&lt;imeiNumber&gt;12121212121&lt;/imeiNumber&gt;&lt;mobileNo&gt;&lt;/mobileNo&gt;&lt;simImsiNumber&gt;&lt;/simImsiNumber&gt;&lt;publisherKey&gt;f4704f50-eed6-45dd-8927-eaf170905520&lt;/publisherKey&gt;&lt;oemOperatorName&gt;demo.oem&lt;/oemOperatorName&gt;&lt;language&gt;en_us&lt;/language&gt;&lt;fullImage&gt;1&lt;/fullImage&gt;&lt;geoLocation&gt;Pune:Maharashtra:India&lt;/geoLocation&gt;&lt;clientId&gt;110&lt;/clientId&gt;&lt;noOfAdRequired&gt;10&lt;/noOfAdRequired&gt;&lt;mediaProperty&gt;Agrowon&lt;/mediaProperty&gt;&lt;mediaPropertyType&gt;Web&lt;/mediaPropertyType&gt;&lt;mediaCategory&gt;Home&lt;/mediaCategory&gt;&lt;slot&gt;right_middle&lt;/slot&gt;&lt;page&gt;home&lt;/page&gt;&lt;/request&gt;</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/ws/AdvertiserService/fetchAd</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/xml</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>